# (if all you see is the next line, ending in =...=, then the buffer is
# "folded"; to see the rest of the put your cursor at the beginning of
# the next line and type [TAB] twice.

*** Inline source blocks

Source blocks can also be expressed using a =src_LANG= construct; a
=#+name:= line can be used to name the =src_LANG= block.  for example,
src_R{"hello, world"}.

Inline source blocks have their own syntax for [[headerarguments][header arguments]]:
src_R[:results output]{cat("hello, again")}.

And, the results of an inline source block can be used as input (via
[[var][:var]]) to another source block.

#+name: whyo
src_R{"42"} {{{results(=42=)}}}

#+begin_src R :var x=whyo :exports results
x
#+end_src

#+RESULTS:
| 42 |
|    |

*** <<colnames>> =:colnames and :rownames=

When processing a table result of a previous source block to be used
as an input [[var][variable]] to another code block, the =:colnames= header
argument instructs Org Mode how to interpret the first row: should it
be assumed to be a row of column names, a row of data, or should Org
Mode use a heuristic to make that determination.

Similarly, Org Mode uses =:rownames= to determine whether the first
column of each row should be considered as a name for that row, or
simply as the data of the first column of that row.

Also, when processing the *results* of a code block, these header
arguments tell some Org Mode language support routines how to deal
with column and row names of the returned result.  If left off, the
Org Mode result of evaluation will drop any language-specific column
and row names.  However, if these header arguments are set to =yes=,
language-specific column and row names will be included in the results
placed in the Org Mode buffer.

#+BEGIN_SRC R
mtcars[1:3,]
#+END_SRC

#+RESULTS:
|   21 | 6 | 160 | 110 |  3.9 |  2.62 | 16.46 | 0 | 1 | 4 | 4 |
|   21 | 6 | 160 | 110 |  3.9 | 2.875 | 17.02 | 0 | 1 | 4 | 4 |
| 22.8 | 4 | 108 |  93 | 3.85 |  2.32 | 18.61 | 1 | 1 | 4 | 1 |

#+begin_src R :colnames yes :rownames yes
mtcars[1:3,]
#+end_src

*** <<var>> =:var=

In Org Mode, the evaluation of source blocks can include initializing
variables, using the =:var= header argument.

#+name: gives-pi
#+begin_src R :var pi=3.14
  pi
#+end_src

The left hand side of the argument to =:var= is the name of the
variable as seen by the code inside the source block.  The right hand
side can be a constant (as above), or can designate the output of
another source block in the .org file.  In that case, the right hand
side is the name (=#+name:=) of the source block providing the desired
result.

If you evaluate the following source block, you will be asked to allow
evaluation *twice*: once to produce the result from the *above* source
block, and a second time to produce the result from the source block
you are evaluating.

#+begin_src R :var pitoo=gives-pi :session R :results output
  cat("you were", pitoo/pi, "close!\n")
#+end_src

The language of the source block providing the value of the variable
does same as the language of the source block receiving the value.  In
general, though, there may be some adaptation required to mould the
shape of the input value to that needed by the source code.

#+name: from-python
#+begin_src python :results value
  return 21
#+end_src

#+name: to-r
#+begin_src R :var howmany=from-python
  2*howmany
#+end_src

The name on the right hand side, instead of naming another source
block in the file, can also name, e.g., an Org Mode table.

#+name: a-table
| student | first exam | second exam | final |
|---------+------------+-------------+-------|
| Greg    |          1 |           3 |     2 |
| George  |          2 |           2 |     2 |
| Linda   |          3 |           1 |     2 |
| Georgia |          4 |           4 |     4 |

In the following code block, the [[colnames][:colnames]] header argument is set to
=yes= so that the first row is considered a row of column names.

#+begin_src R :var tbl=a-table :colnames yes :session R
  summary(tbl)
#+end_src

#+RESULTS:
| student          | first.exam   | second.exam  | final       |
|------------------+--------------+--------------+-------------|
| Length:4         | Min.   :1.00 | Min.   :1.00 | Min.   :2.0 |
| Class :character | 1st Qu.:1.75 | 1st Qu.:1.75 | 1st Qu.:2.0 |
| Mode  :character | Median :2.50 | Median :2.50 | Median :2.0 |
|                  | Mean   :2.50 | Mean   :2.50 | Mean   :2.5 |
|                  | 3rd Qu.:3.25 | 3rd Qu.:3.25 | 3rd Qu.:2.5 |
|                  | Max.   :4.00 | Max.   :4.00 | Max.   :4.0 |

For R code, a second effect of setting =:colnames= to =yes= is that if
the *result* is an R data frame, its column names (=colnames()=) will
be preserved in the resulting Org Mode table

#+begin_src R :colnames yes
  mtcars[1:4,]
#+end_src

#+RESULTS:
|  mpg | cyl | disp |  hp | drat |    wt |  qsec | vs | am | gear | carb |
|------+-----+------+-----+------+-------+-------+----+----+------+------|
|   21 |   6 |  160 | 110 |  3.9 |  2.62 | 16.46 |  0 |  1 |    4 |    4 |
|   21 |   6 |  160 | 110 |  3.9 | 2.875 | 17.02 |  0 |  1 |    4 |    4 |
| 22.8 |   4 |  108 |  93 | 3.85 |  2.32 | 18.61 |  1 |  1 |    4 |    1 |
| 21.4 |   6 |  258 | 110 | 3.08 | 3.215 | 19.44 |  1 |  0 |    3 |    1 |

#+begin_src R :colnames no
  mtcars[1:4,]
#+end_src

#+RESULTS:
|   21 | 6 | 160 | 110 |  3.9 |  2.62 | 16.46 | 0 | 1 | 4 | 4 |
|   21 | 6 | 160 | 110 |  3.9 | 2.875 | 17.02 | 0 | 1 | 4 | 4 |
| 22.8 | 4 | 108 |  93 | 3.85 |  2.32 | 18.61 | 1 | 1 | 4 | 1 |
| 21.4 | 6 | 258 | 110 | 3.08 | 3.215 | 19.44 | 1 | 0 | 3 | 1 |

*** =:results=
	:PROPERTIES:
    :header-args+: :noweb yes
    :END:

The =:results= header argument specifies many things.  First, it
specifies whether the results of an evaluation consist in the value
"returned" by the evaluated source block, or by the output (to
standard output) produced by the source block.  The "value returned"
means, in many programming languages (include R), the value of the
last statement executed in the source block.  You may have noticed
examples of this use of =:results= in some of the previous source
blocks.  The values here are =value= and =output=.

#+name: usenowebhere
#+begin_src R :results none
  truepi <- pi
  cat(truepi, "\n", sep="")
  invisible(truepi*2)
#+end_src

#+begin_src R :results output
  <<usenowebhere>>
#+end_src

#+RESULTS:
: 3.141593

#+begin_src R :results value
  <<usenowebhere>>
#+end_src

#+RESULTS:
: 6.28318530717959

**** How the results are formatted

There are various ways Org Mode might decide to format the results,
of, more or less, whatever type, before embedding them in the .org
buffer.

For example, to want the results to be wrapped in a source block, one
can specify =code=:

#+begin_src R :results value code
  "<<results-noweb>>"
#+end_src

#+RESULTS:
:results:
mtcars[c(1,12,13, 19),]
:end:

This also shows that =noweb= syntax isn't defeated by, e.g., being
embedded inside quotation marks.  One can also specify that the
results be embedded in an Org Mode "drawer" (which can be "closed", so
the results don't show), or embedded in a source block of type "org",
in blocks whose content will only be used when exporting to HTML, or
to LaTeX (including PDF), etc.

There is (apparently -- writing this tutorial is a learning
experience!) also a =:wrap= header argument, separate from the
=:results= header argument, which specifies a value =X=, and the
results are summarily wrapped in a =#+begin_X...#+end_X= block.

#+begin_src R :wrap foo
  3
#+end_src


**** Handling of results

Typically, the results of evaluating a source block are placed in the
buffer following the source block, preceded by a line
: #+RESULTS: <NAME>
where =<NAME>= is the name of the source block, if any, or blank.

#+begin_src R
  Sys.time()
#+end_src

#+RESULTS:
: 2021-03-31 09:01:47

#+name: time
#+begin_src R
  Sys.time()
#+end_src

#+RESULTS: time
: 2021-03-31 09:01:57

However, this behavior can be modified with the =:results= header
argument.  The relevant options are
- silent :: Don't change the buffer.  The results are echoed in the
  minibuffer.
- replace :: This is the normal behavior; the =#+RESULTS:= block is
  replaced.
- append :: Each evaluation generates a separate =#+RESULTS:= block,
  which is placed after the previous result blocks.
- prepend :: Each evaluation generates a separate results block, which
  is placed before all previous result blocks.

Well, really, that is all pretty much just copied from the [[https://orgmode.org/manual/Results-of-Evaluation.html#Results-of-Evaluation][manual]].
Which, see.

